<html>

<head>
<meta http-equiv="Content-Language" content="es">
<meta name="GENERATOR" content="Microsoft FrontPage 5.0">
<meta name="ProgId" content="FrontPage.Editor.Document">
<meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
<title>DeepSkyStacker FAQ</title>
<style>
<!--
 div.MsoNormal
	{mso-style-parent:"";
	margin-bottom:.0001pt;
	font-size:12.0pt;
	font-family:"Times New Roman";
	margin-left:0cm; margin-right:0cm; margin-top:0cm}
-->
</style>
</head>

<body>

<p><b><span lang="ES-ES" style="font-size: 18.0pt; font-family: Arial">
Preguntas Frecuentes</span></b></p>
<blockquote>

<p><span lang="ES-ES"><b><span style="font-family: Arial"><a href="#Install">
Instalaci&oacute;n</a><br>
<a href="#lightdarkflatoffset">Light, Dark, Flat, Bias... &iquest;Qu&eacute; son y c&oacute;mo los creamos?</a><br>
<a href="#FileAndList">Archivos y Listas de Archivos</a><br>
<a href="#Registering">Registrando</a><br>
<a href="#Stacking">Apilando</a><br>
<a href="#Processing">Procesando</a><br>
<a href="#Performances">Desempe&ntilde;o</a><br>
<a href="#saveresult">Cargar/Guardar</a><br>
</span></b></span><b>
<span lang="ES-ES" style="font-family: Arial; ">
<a href="#Misc">Miscel&aacute;neos</a></span></b></p>
</blockquote>
<hr color="#0000FF">
<p align="justify"><font face="Arial"><b><font size="4" color="#FF0000">
<a name="Install"></a>Instalaci&oacute;n</font><br>
<font size="2">El archivo zip descargado esta corrupto.<br>
</font></b><font size="2">Les puedo asegurar que el archivo zip que esta en el sitio esta en perfecto estado. Es muy probable que Ud. est&eacute; utilizando un acelerador de descargas.<br>
Desactivelo, descargue nuevamente el archivo y todo deber&iacute;a de funcionar correctamente. <br>
</font><b>
<font size="2"><br>
No puedo instalar el DeepSkyStacker (mensaje de DLL no encontrada) ?<br>
</font></b><font size="2">Si Ud. durante la instalaci&oacute;n del DeepSkyStacker recibe el mensaje de DLL no encontrada es probable que Ud. no tenga instalado el Windows XP SP2.</font></font><br>
<font size="2" face="Arial">En este caso deber&aacute; descargar e instalar el</font><font face="Arial"><font size="2"> <a target="_blank" href="http://www.microsoft.com/downloads/details.aspx?FamilyID=889482FC-5F56-4A38-B838-DE776FD4138C&displaylang=en">
Windows Installer 3.1</a>.</font></font></p>
<div class="MsoNormal" align="center" style="text-align:center">
  <span lang="ES-ES">
  <hr size="2" width="100%" noshade color="blue" align="center"></span>
</div>
<p align="justify"><span lang="ES-ES"><font size="4" color="#FF0000"><b>
<span style="font-family: Arial"><a name="lightdarkflatoffset"></a>Light, Dark, 
Flat, Bias... &iquest;Qu&eacute; son y c&oacute;mo los creamos?</span></b></font></span><span lang="ES-ES" style="font-family: Arial"><b><br>
<br>
Archivos de Imagen Light<br>
</b><font size="2">Los archivos de imagen Light son im&aacute;genes que contienen la informaci&oacute;n real, im&aacute;genes de galaxias, nebulosas.<br>
Esto es lo que queremos apilar.<br>
<br>
</font><b>Archivos de Imagen Dark<br>
</b><font size="2">Los archivos de imagen Dark son utilizados para remover la se&ntilde;al oscura de los 
archivos de imagen light (o los archivos de imagen flat para los archivos de imagen Dark Flat) <br>
Con las c&aacute;maras DSLR y CCD, el CMOS o CCD genera una se&ntilde;al oscura dependiendo del tiempo de exposici&oacute;n, temperatura y velocidad o velocidad ISO (s&oacute;lo en c&aacute;maras DSLR).<br>
Para remover la se&ntilde;al oscura de los archivos de imagen light se utiliza un  archivos de imagen dark que contiene s&oacute;lo la se&ntilde;al oscura.<br>
<br>
La mejor forma de crear los archivos de imagen dark es disparar fotos en la oscuridad (de aqu&iacute; el nombre) cubriendo la lente.<br>
Los archivos de imagen dark deben ser creados con el mismo tiempo de exposici&oacute;n, temperatura y velocidad ISO que usamos para los archivos de imagen light. (resp. archivos de imagen flat) <br>
Debido a que la temperatura es importante trate de realizar los archivos de imagen dark al final o durante la sesi&oacute;n de fotograf&iacute;a..<br>
<br>
Realice varias tomas (entre 10 y 20 son suficientes por lo general). DeepSkyStacker las combinar&aacute; autom&aacute;ticamente para crear y utilizar un archivos de imagen dark maestro.<br>
</font></span></p>
<p align="justify"><span lang="ES-ES" style="font-family: Arial"><b>Archivos de imagen Bias (tambi&eacute;n conocidas  como archivos de imagen Offset)<br>
  </b><font size="2">Los archivos de imagen Bias/Offset son utilizadas para remover de los archivos de imagen light la se&ntilde;al de lectura del chip CCD o CMOS.<br>
  Cada chip CCD o CMOS genera una se&ntilde;al de lectura la cual es una  creada por el circuito electr&oacute;nico al leer el contenido del chip.<br>
  <br>
  Es muy f&aacute;cil crear  archivos de imagen bias/offset: solo tiene que realizar exposiciones de cort&iacute;sima duraci&oacute;n (puede ser  1/4000s o 1/8000s dependiendo de la c&aacute;mara) en la oscuridad y con la lente tapada.<br>
  Los archivos de imagen bias deben ser creados con la misma velocidad ISO de los archivos de imagen light. La temperatura no es importante.<br>
  <br>
  <br>
  Realice varias tomas (entre 10 y 20 son suficientes por lo general). DeepSkyStacker las combinar&aacute; autom&aacute;ticamente para crear y utilizar un  archivo de imagen bias/offset maestro. <br>
  <br>
  </font><b>Archivos de imagen Flat<br>
  </b><font size="2">Los archivos de imagen Flat son utilizados para corregir el vigneteo y la iluminaci&oacute;n despareja creada por polvo o manchas en el tren &oacute;ptico.<br>
  <br>
  Para crear buenos archivos de imagen flat es muy importante  <u><b>no</b></u> remover la c&aacute;mara del telescopio antes de realizar la toma (adem&aacute;s de no cambiar el foco).<br>
Puede utilizar un mont&oacute;n de distintos m&eacute;todos (incluyendo el uso de la un flatbox) pero la forma m&aacute;s simple que encontre fue colocar una remera blanca  frente al telescopio evitando las costuras. Luego disparar a alg&uacute;n objeto luminoso (un flash, una luz blanca brillante, el cielo al amanecer...) y dejar que la c&aacute;mara decida el tiempo de exposici&oacute;n (modo Av), </font></span></p>
<p align="justify"><span lang="ES-ES" style="font-family: Arial"><font size="2">Los archivos de imagen flat deben ser creados con la misma velocidad ISO de los archivos de imagen light. La temperatura no es importante.<br>
  <br>
  Realice varias tomas (entre 10 y 20 son suficientes por lo general). DeepSkyStacker las combinar&aacute; autom&aacute;ticamente para crear y utilizar un  archivos de imagen flat maestro. </font></span></p>
<p><b><font face="Arial" size="2">¿Es posible utilizar imágenes flat de colores?
</font></b><font face="Arial" size="2"><br>
La respuesta rápida es si. <br>
El tinte general de sus imágenes flat realmente no es importante debido a que el 
DeepSkyStacker procesa cada canal por separado y aplica las imágenes flat a cada 
canal respectivamente. <br>
Por supuesto si sus archivos flat son totalmente rojos solo el canal rojo de sus 
archivos de imagen será calibrados adecuadamente, mientras que el pico de cada 
canal este enre 1/3 y 2/3 del máximo no debería tener problemas al utilizar 
archivos flat apenas coloreados. </font></p>
<div class="MsoNormal" align="center" style="text-align:center">
  <span lang="ES-ES">
  <hr size="2" width="100%" noshade color="blue" align="center"></span>
</div>
<p align="justify"><span lang="ES-ES"><font size="4" color="#FF0000"><b>
<span style="font-family: Arial"><a name="FileAndList"></a>Archivos y Listas de Archivos</span></b></font></span><br>
<b><span lang="ES-ES" style="font-family: Arial">
<font size="2"><a name="TIFFIssue"></a>DSS no puede leer mis archivos TIFF y/o se cuelga cuando intenta leer archivos TIFF</font></span><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial"><br>
</span></b><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">
DeepSkyStacker s&oacute;lo soporta archivos TIFF sin comprimir o archivos comprimidos con LZQ y ZIP (Deflate).<br>
De todos modos, los archivos TIFF pueden venir en muchas variantes y a veces la decodificaci&oacute;n puede fallar especialmente decodificando la informaci&oacute;n EXIF.<br>
Es posible desactivar la decodificaci&oacute;n EXIF al leer archivos TIFF agregando la siguiente clave de registro bajo <b>HKEY_CURRENT_USER\Software\DeepSkyStacker</b>: 
SkipTIFFExifInfo (DWORD) con un valor de 1.<br>
<br>
Si Ud. no sabe como agregar una clave de registro, puede descargar este 
<a href="../download/DSS_SkipTIFFExifInfo.reg">peque&ntilde;o archivo</a> y hacer doble click en &eacute;l. Este agregar&aacute; la clave por Ud. </span></p>
<hr color="#0000FF" size="1">
<p align="justify">
<font size="2" face="Arial"><b>Mis archivos FITS no son decodificados correctamente.<br>
</b>Hay un mont&oacute;n de formatos de archivos FITS dando vueltas.<br>
Si su archivo FITS no es decodificado correctamente por favor env&iacute;eme un correo electr&oacute;nico con el archivo FITS adjunto.</font></p>
<hr color="#0000FF" size="1">
<p align="justify"><font face="Arial" size="2"><b>Mis archivos FITS fueron creados con una DSLR y son muy oscuros y sin contraste.<br>
</b>Los programas que capturan la salida de una DSLR y posterior guardado como archivos FITS a veces utilizan el formato de archivo de 16 bits para almacenar im&aacute;genes de solo 12 bits de profundidad (profundidad de bits original de la mayor&iacute;a de los archivos RAW de DSLR).<br>
En este caso los valores almacenados en los archivos est&aacute;n entre 0 y 4095 en vez de 0 a 65535 lo que explica porque las im&aacute;genes son tan oscuras.<br>
Ud. puede ajustar los par&aacute;metros en la  <a href="userguide.htm#rawddp">Pesta&ntilde;a de Archivos FITS</a> dentro de la ventana de Configuraci&oacute;n DPP  RAW/FITS para ver estos archivos en forma correcta.<br>
Dicho de una manera simple Ud. puede multiplicar el brillo total hasta 16 veces sin exceder el umbral m&aacute;ximo. Si Ud. modifica el balance de blancos cambiando las escalas de rojo y/o azul tenga cuidado de no superar el multiplicador por 16 para cada canal (brillo * escala de canal).</font></p>
<hr color="#0000FF" size="1">
<p align="justify"><font face="Arial" size="2"><b>Mis archivos FITS fueron creados con una DSLR y aparecen todos mal mientras que elegi la DSLR correcta en la pesta&ntilde;a de Archivos FITS<br>
</b>Ud. deber&iacute;a chequear que el software que realiz&oacute; las capturas no utilizo &quot;binning&quot;. En este caso DSS no puede utilizar el Patr&oacute;n de Filtros Bayer est&aacute;ndar de su DSLR y por esta raz&oacute;n todas sus im&aacute;genes aparecen mal.<br>
La &uacute;nica forma de solucionarlo es desactivando el &quot;binning&quot;.</font></p>
<hr color="#0000FF" size="1">
<p align="justify"><font face="Arial" size="2"><b>Mis archivos FITS fueron creados con una c&aacute;mara CCD color y s&oacute;lo veo las im&aacute;genes en Blanco y Negro.<br>
</b>Sus archivos FITS estan utilizando una Matriz Bayer (como una DSLR). Para decodificar correctamente los colores  DeepSkyStacker debe saber que tipo de Matriz Bayer utiliza su c&aacute;mara.<br>
Ud. puede indicarle al  DeepSkyStacker en la pesta&ntilde;a FITS en la ventana <a href="userguide.htm#rawddp">Configuraci&oacute;n RAW/FITS DPP</a>   que matrix Bayer debe ser utilizada. La mayor&iacute;a de las veces tendr&aacute; que seleccionar su c&aacute;mara CCD de la lista.</font></p>
<hr color="#0000FF" size="1">
<p align="justify"><font face="Arial"><font size="2"><b>&iquest;Que es una Lista de Archivos?<br>
</b>Una Lista de Archivos es un archivo de texto plano que contiene nombres de archivos con, para cada uno de ellos, su tipo (light, dark, flat, offset) y el status 
(seleccionado o deseleccionado).<br>
Debe tener en cuenta que cuando se carga una Lista de Archivos la lista que contiene todos los archivos no se vac&iacute;a.<br>
De esta forma es posible tener una Lista de Archivos con todos los archivos de imagen dark, otra con los archivos de imagen flat, y una tercera con el offset maestro y todas las Listas de Archivos para cargarlas en una sola operaci&oacute;n..<br>
El formato de la Lista de Archivos esta explicado en detalle  <a href="commandline.htm#filelistformat">
aqui</a>.</font></font></p>
<hr color="#0000FF" size="1">
<p align="justify"><b><font face="Arial" size="2">Tengo archivos del mismo objeto tomadas en m&uacute;ltiples sesiones. &iquest;Como le indico a DSS que asocie correctamente los archivos de imagen darks y light de la misma noche para cada noche?</font></b><font size="2" face="Arial"><b><br>
</b>La respuesta a esta pregunta es utilizar  <a href="technical.htm#filegroup">Grupos de Archivos</a>.</font></p>
<div class="MsoNormal" align="center" style="text-align:center">
  <span lang="ES-ES">
  <hr size="2" width="100%" noshade color="blue" align="center"></span>
</div>
<p align="justify"><b>
<span lang="ES-ES" style="font-size: 13.5pt; font-family: Arial; color: red">
<a name="Registering"></a>Registrando</span><span lang="ES-ES" style="font-family: Arial"><br>
</span><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">&iquest;Porqu&eacute; crear un archivo de registro para cada imagen?<br>
</span></b><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">
Debido a que es simple y evita la re-registraci&oacute;n..<br>
Esta es tambien otra forma de evitar la carga de todas las im&aacute;genes durante el proceso de registrado y apilado.</span></p>
<hr color="#0000FF" size="1">
<p align="justify"><b><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">&iquest;Puedo borrar el archivo de registro?<br>
</span></b><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">Si. 
Este ser&aacute; recreado de ser necesario.</span></p>
<hr color="#0000FF" size="1">
<p align="justify"><b><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">&iquest;Puedo modificar el contenido del archivo de registro?<br>
</span></b><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">Si, aunque no es ni aconsejado ni necesario. <br>
No puedo garantizar que el contenido no evolucione, pero garantizo que el contenido actual siempre sera decodificado.</span></p>
<hr color="#0000FF" size="1">
<p align="justify"><b><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">
<a name="score"></a>&iquest;Qu&eacute; es el puntaje, y cu&aacute;l es su significado?<br>
</span></b><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">El puntaje es una medida de la calidad de la imagen.<br>
Para hacerlo simple, cuanto m&aacute;s alto sea el puntaje, las estrellas ser&aacute;n mas redondas y peque&ntilde;as. </span></p>
<hr color="#0000FF" size="1">
<p align="justify"><b><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">&iquest;El puntaje es una medida de la calidad absoluta de la imagen?<br>
</span></b><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">No. 
El puntaje es una medida relativa que s&oacute;lo se utiliza para ordenar las im&aacute;genes de un &aacute;rea aproximadamente similar de tal forma de mantener s&oacute;lo las mejores imagenes para el apilado.<br>
Si modifica la <a style="color: blue; text-decoration: underline; text-underline: single" href="technical.htm#rawdecod">configuraci&oacute;n del proceso de desarrollo RAW</a> deber&aacute; registrar las im&aacute;genes nuevamente y un nuevo puntaje ser&aacute; calculado.</span></p>
<div class="MsoNormal" align="center" style="text-align:center">
  <span lang="ES-ES">
  <hr size="2" width="100%" noshade color="blue" align="center"></span>
</div>
<p align="justify"><b>
<span lang="ES-ES" style="font-size: 13.5pt; font-family: Arial; color: red">
<a name="Stacking"></a>Apilado</span><span lang="ES-ES" style="font-family: Arial"><br>
</span><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">
<a name="autosave"></a>&iquest;Que es el archivo  AutoSave.DSImage creado luego del proceso de apilado?<br>
</span></b><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">El archivo AutoSave.DSImage es un archivo propio el cu&aacute;l es creado autom&aacute;ticamente al final de cada proceso de apilado y que contiene la imagen resultante. Esta en formato de canales de 32 bits (rational).<br>
Debido a que la &uacute;nica forma de crear este archivo es realizar un nuevo proceso de apilado no es posible sobreescribirlo por error.<br>
Este puede ser abierto nuevamente en la pesta&ntilde;a de procesamiento..<br>
A partir de la version  2.5.3 el archivo AutoSave.DSImage es reemplazado por un archivo AutoSave.tif el cu&aacute;l es un archivo TIFF de 32 bits rational (Deflate compressed).</span></p>
<p align="justify"><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">Los viejos archivos .DSImage a&uacute;n pueden ser abiertos por  DeepSkyStacker.</span></p>
<hr color="#0000FF" size="1">
<p align="justify"><b>
<span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">La imagen resultante muestra grupos de estrellas multiples en toda la imagen<br>
</span></b><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">
Los grupos de estrellas m&uacute;ltiples son una se&ntilde;al clara que el proceso de alineado esta bas&aacute;ndose en estrellas &quot;falsas&quot;.<br>
La principal raz&oacute;n es que los hot pixels est&aacute;n perturbando el proceso de registrado y por lo tanto creando estrellas falsas.<br>
Ud. puede intentar detectar los hot pixels autom&aacute;ticamente (ver Opciones de Registraci&oacute;n) o, 
mucho mejor, cargar y verificar sus <font size="2">archivos de imagen </font>dark antes de comenzar el proceso de apilado.<br>
Todos los <font size="2">archivos de imagen </font> dark, flat y offsets ser&aacute;n aplicados a cada <font size="2">archivos de imagen </font>light  del proceso de registraci&oacute;n garantizando que ningun hot pixel o artefacto perturbar&aacute; la detecci&oacute;n de estrellas la cu&aacute;l sera mucho mejor y m&aacute;s precisa. </span></p>
<hr color="#0000FF" size="1">
<p align="justify"><b>
<span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">La imagen resultante muestra una imagen extremadamente recortada en el borde superior izquierdo<br>
</span></b><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">
Este es el resultado de registrar los <font size="2">archivos de imagen </font>light utilizando el modo de s&uacute;per pixeles y el apilado en otro modo.<br>
Cuando cambia de o a el modo s&uacute;per pixeles es necesario registrar los <font size="2">archivos de imagen </font>light nuevamente.</span></p>
<hr color="#0000FF" size="1">
<p align="justify"><font size="2"><b><span style="font-family: Arial">Mis archivos de imagen dark no tienen todos la misma exposici&oacute;n y el DeepSkyStacker no los agrupa.</span></b></font><b><span style="font-size: 10.0pt; font-family: Arial"><br>
</span></b><span style="font-size: 10.0pt; font-family: Arial">Si no utiliza una forma autom&aacute;tica para tomar cada imagen a menudo es posible que los tiempos de exposici&oacute;n sean diferentes en algunos segundos y en ese caso  DeepSkyStacker no los agrupa para crear un dark maestro.<br>
Ud. puede forzar el tiempo de exposici&oacute;n de cada imagen al mismo valor seleccionando las im&aacute;genes en la lista y utilizando el menu contextual para editar las 
<a href="userguide.htm#contextmenu">propiedades de las im&aacute;genes</a>.</span></p>
<hr color="#0000FF" size="1">
<p align="justify"><font size="2"><b><span style="font-family: Arial">Mi imagen resultante es muy oscura. &iquest;Es esto normal?<br>
</span></b></font><span style="font-size: 10.0pt; font-family: Arial">Las im&aacute;genes RAW son muy oscuras y apilarlas crea una imagen resultante muy oscura.<br>
Para ver los detalles en la imagen tiene que encoger el histograma ajustando los niveles RGB y la luminancia en la  <a href="userguide.htm#processingtab">
Pesta&ntilde;a de Procesamiento</a>.</span></p>
<hr color="#0000FF" size="1">
<p align="justify"><font size="2"><b><span style="font-family: Arial"><strong>&iquest;C&oacute;mo alineo las im&aacute;genes resultantes de 4 apiladas (rojo, verde, azul y lumnancia)?</strong><br>
</span></b></font><span style="font-size: 10.0pt; font-family: Arial">Para alinear las im&aacute;genes resultantes en el mismo archivo de imagen de referencia solo tiene que agregar el archivo de imagen de referencia a la lista incluso si no corresponde a la misma apilada, forzando al DeepSkyStacker a usarlo como archivo de imagen de referencia   (utilizando el  <A href="userguide.htm#contextmenu">menu contextual</A>) pero sin tenerlo seleccionado. <BR>
Esto le dice al DeepSkyStacker que lo utilice como archivo de imagen de referencia pero que no lo agregue a la pila..</span></p>
<div class="MsoNormal" align="center" style="text-align:center">
  <span lang="ES-ES">
  <hr size="2" width="100%" noshade color="blue" align="center"></span>
</div>
<p align="justify"><b>
<span lang="ES-ES" style="font-size: 13.5pt; font-family: Arial; color: red">
<a name="Processing"></a>Procesamiento<br>
</span><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">&iquest;Qu&eacute; es el archivo  DSSSettings.DSSSettings creado en la carpeta DeepSkyStacker?<br>
</span></b><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">El archivo DSSSettings.DSSSettings contiene todas las configuraciones de ajustes que pueden ser guardadas y cargadas desde la pesta&ntilde;a de procesamiento.</span></p>
<hr color="#0000FF">
<p align="justify"><b><font face="Arial" size="4" color="#FF0000">
<a name="Performances"></a>Desempe&ntilde;o<br>
</font><font face="Arial" size="2">&iquest;Como acelero el apilado</font></b><font size="2" face="Arial"><b>?<br>
</b>Mas all&aacute; de las respuestas obvias (procesador m&aacute;s r&aacute;pido, m&aacute;s memoria), la mejor forma de acelerar el procesamiento es utilizar modos sin interpolaci&oacute;n (<a href="technical.htm#bayerdrizzle">Bayer 
Drizzle y Super Pixeles</a>) o las interpolaciones bilinear y AHD las cuales trabajan solamente en los archivos RAW con canales de 16 bits en vez de los 3 canales RGB.<br>
La decodificaci&oacute;n de las im&aacute;genes es m&aacute;s r&aacute;pida  (r&aacute;pida o sin interpolaci&oacute;n), la cantidad de memoria requerida es la tercera parte y los archivos de imagen</font><font size="2" face="Arial"> flat, dark y offset son calculados e internamente almacenados con un s&oacute;lo plano en vez de 3.<br>
<br>
Otra forma de lograr  m&aacute;s r&aacute;pidamente la imagen resultante es utilizando un 
<a href="technical.htm#customrect">Rect&aacute;ngulo a Medida</a> el cu&aacute;l contiene s&oacute;lo la parte interesante de la imagen.</font></p>
<div class="MsoNormal" align="center" style="text-align:center">
  <span lang="ES-ES">
  <hr size="2" width="100%" noshade color="blue" align="center"></span>
</div>
<p align="justify"><b>
<span lang="ES-ES" style="font-size: 13.5pt; font-family: Arial; color: red">
<a name="saveresult"></a>Cargar/Guardar</span><span lang="ES-ES" style="font-family: Arial"><br>
</span><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">&iquest;D&oacute;nde se guardan los ajustes de post-procesamiento en los archivos TIFF?<br>
</span></b><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">Los ajustes son almacenados en tags TIFF privados. Es una caracter&iacute;stica documentada del formato de archivo TIFF.<br>
Por otro lado si sobreescribe el archivo con un programa distinto al DeepSkyStacker, se remover&aacute;n los tags privados y se perder&aacute;n los ajustes. </span></p>
<hr color="#0000FF" size="1">
<p align="justify"><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">
<b>&iquest;Cu&aacute;l es la diferencia entre la configuraci&oacute;n de aplicar ajustes y la configuraci&oacute;n y agregar ajustes en el archivo TIFF?<br>
</b>Cuando la configuraci&oacute;n de los ajustes es agregada a la imagen guardada, el archivo TIFF contiene la imagen sin ninguna modificaci&oacute;n tal como resulta del proceso de apilado. La configuraci&oacute;n es inclu&iacute;da de tal forma que la pr&oacute;xima vez que abra el archivo TIFF en DeepSkyStacker puede continuar trabajando donde lo dejo.<br>
Esta opci&oacute;n es &uacute;til si desea continuar luego post-procesando utilizando el DeepSkyStacker o si desea realizar todo el post-procesamiento con otro programa.<br>
Cuando la configuraci&oacute;n de los ajustes es aplicada, la imagen almacenada en el archivo TIFF es la resultante de aplicar la configuraci&oacute;n a la imagen resultante del proceso de apilado. Es la imagen tal como la ve en la pesta&ntilde;a de procesamiento.</span></p>
<hr color="#0000FF" size="1">
<p align="justify"><b><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">&iquest;El Photoshop 
no puede abrir los archivos TIFF de  32 bits (integer) creados por  DeepSkyStacker?<br>
</span></b><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">
Correcto, Ud. debe grabar la imagen en formato de archivo TIFF de 32 bits (rational) para abrirla m&aacute;s tarde en  Photoshop. <br>
Programas como el 
Pleiades PixInsight pueden abrir archivos TIFF de 32 bits (integer) creados por el 
DeepSkyStacker.</span></p>
<hr color="#0000FF" size="1">
<p align="justify"><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">
<b>&iquest;El DeepSkyStacker utiliza el registry para almacenar sus ajustes?<br>
</b>S&iacute;. El DeepSkyStacker almacena los ajustes asociados con el usuario en la base de datos del registro: &uacute;ltimas carpetas para cada tipo de archivo, &uacute;ltimos ajustes de las ventanas... <br>
Todo es almacenado en la clave HKEY_CURRENT_USER\Software\DeepSkyStacker</span></p>
<div class="MsoNormal" align="center" style="text-align:center">
  <span lang="ES-ES">
  <hr size="2" width="100%" noshade color="blue" align="center"></span>
</div>
<p align="justify"><b>
<span lang="ES-ES" style="font-size: 13.5pt; font-family: Arial; color: red">
<a name="Misc"></a>Miscel&aacute;neos</span></b><span lang="ES-ES"><br>
</span><b><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">&iquest;Porqu&eacute; 
DeepSkyStacker?<br>
</span></b><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">
Simplemente porque el hecho de pasar incontables horas repitiendo las mismas tareas una y otra vez para cada nuevo set de im&aacute;genes dejo de resultarme interesante.<br>
Cada propietario de una  DSLR entender&aacute; de que estoy hablando: transformaci&oacute;n a TIFF (o CFA para los m&aacute;s audaces), registrado, apilado...<br>
<br>
Despues de probar un mont&oacute;n de programas hambrientos de memoria decid&iacute; escribir el software que resuelva mi problema: tomar un mont&oacute;n de im&aacute;genes (algunas veces varios cientos) y hacer todo el proceso autom&aacute;ticamente de tal forma de poder irme a dormir sabiendo que a la ma&ntilde;ana siguiente puedo comenzar el post-procesamiento que es la parte divertida.</span></p>
<hr color="#0000FF" size="1">
<p align="justify"><b><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">&iquest;Porqu&eacute; no im&aacute;genes planetarias?<br>
</span></b><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">&iquest;Porqu&eacute;? 
Debido a que no hago fotograf&iacute;a planetaria no tengo experiencia y no sabr&iacute;a por donde comenzar.<br>
Tal vez un d&iacute;a encuentre inter&eacute;s y escriba PlanetaryStacker... pero no cuenten con ello por lo pronto.</span></p>
<hr color="#0000FF" size="1">
<p align="justify"><b><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">&iquest;Y el  
DeepSkyStacker 1.0?<br>
</span></b><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">
El DeepSkyStacker 1.0 fue utilizado solamente por mi y por amigos cercanos. No fue pensado hacerlo p&uacute;blico y por m&aacute;s que el motor ya estaba all&iacute; hab&iacute;a un mont&oacute;n de caracter&iacute;sticas que faltaban.<br>
DeepSkyStacker 2.0 es la primera versi&oacute;n p&uacute;blica.</span></p>
<hr color="#0000FF" size="1">
<p align="justify"><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">
<b>&iquest;En que lenguaje esta escrito el DeepSkyStacker?<br>
</b>DeepSkyStacker esta codificado en  C++.</span></p>
<hr color="#0000FF" size="1">
<p align="justify"><b><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">&iquest;C&oacute;mo son decodificados los archivos RAW?<br>
</span></b><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">Los archivos RAW son decodificados utilizando el espectacular
<a href="http://www.cybercom.net/~dcoffin/dcraw/" target="_blank" style="color: blue; text-decoration: underline; text-underline: single">
DCRAW</a> por Dave Coffin.<br>
Adem&aacute;s,
me gustar&iacute;a agradecerle por sugerirme el algoritmo 
<a style="color: blue; text-decoration: underline; text-underline: single" href="technical.htm#bayerdrizzle">Bayer Drizzle</a>.</span></p>
<hr color="#0000FF" size="1">
<p align="justify"><b><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">&iquest;Es soportado el formato de mi DSLR?<br>
</span></b><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">La 
lista de todas las DSLR soportadas (actualmente más de </span>
<span lang="fr" style="font-size: 10.0pt; font-family: Arial">300</span><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">) se incrementa con el tiempo. Visite el sitio de 
<a href="http://www.cybercom.net/~dcoffin/dcraw/" target="_blank" style="color: blue; text-decoration: underline; text-underline: single">
DCRAW</a>  para saber si es soportada su DSLR .<br>
Si es el caso, entonces es probable que la versi&oacute;n actual del  DeepSkyStacker tambi&eacute;n la soporte.</span></p>
<hr color="#0000FF" size="1">
<p align="justify"><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">
<b>&iquest;C&oacute;mo se leen y escriben las im&aacute;genes TIFF?<br>
</b>Los archivos TIFF son le&iacute;dos y escritos usando la m&aacute;s que excelente biblioteca libtiff</span></p>
<hr color="#0000FF" size="1">
<p align="justify"><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">
<b>&iquest;C&oacute;mo se leen y escriben los archivos FITS?<br>
</b>Los archivos FITS son le&iacute;dos utilizando la m&aacute;s que excelente biblioteca CFitsIO</span></p>
<hr color="#0000FF" size="1">
<p align="justify"><b><font face="Arial" size="2">&iquest;Es posible cambiar el idioma utilizado por DeepSkyStacker?</font></b><font size="2" face="Arial"><b><br>
</b>El idioma utilizado por el  DeepSkyStacker (Franc&eacute;s, Ingl&eacute;s, Espa&ntilde;ol, Checo, Italiano, Catalàn, 
Alemán o Holandés) es seleccionado autom&aacute;ticamente por el que utiliza el Sistema Operativo..<br>
Si Ud. desea forzar otro idioma puede cambiarlo desde la ventana de Acerca de.<br>
Para que los nuevos valores de idioma sean efectivos el DeepSkyStacker deber&aacute; ser reiniciado.</font></p>
<hr color="#0000FF" size="1">
<p align="justify"><font size="2" face="Arial"><b>&iquest;C&oacute;mo chequea si hay una nueva versi&oacute;n disponible el DeepSkyStacker?<br>
</b>Para chequear si hay una nueva versi&oacute;n disponible el  DeepSkyStacker se conecta al comenzar al sitio web y compara la versi&oacute;n utilizada con la versi&oacute;n descargable.<br>
El DeepSkyStacker no env&iacute;a ning&uacute;n tipo de informaci&oacute;n personal al sitio web o ning&uacute;n otro lado durante este proceso. S&oacute;lo descarga un archivo muy peque&ntilde;o que contiene la informaci&oacute;n necesaria.</font></p>
<hr color="#0000FF" size="1">
<p align="justify"><b><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">&iquest;El  
DeepSkyStacker es Open Source / C&oacute;digo Abierto ? &iquest;Est&aacute;n disponibles los programas fuente?<br>
</span></b><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">Bien 
... no y no.</span></p>

<hr color="#0000FF" size="1">
<p align="justify"><span lang="ES-ES" style="font-size: 10.0pt; font-family: Arial">
<b>&iquest;C&oacute;mo desinstalo el DeepSkyStacker?<br>
</b>Simplemente utilice el desinstalador desde la opci&oacute;n Agregar/Remover en el panel de control.</span></p>

<script type="text/javascript">
var gaJsHost = (("https:" == document.location.protocol) ? "https://ssl." : "http://www.");
document.write(unescape("%3Cscript src='" + gaJsHost + "google-analytics.com/ga.js' type='text/javascript'%3E%3C/script%3E"));
</script>
<script type="text/javascript">
try {
var pageTracker = _gat._getTracker("UA-7477345-1");
pageTracker._trackPageview();
} catch(err) {}</script>

</body>

</html>