<html>

<head>
<meta http-equiv="Content-Language" content="de">
<meta name="GENERATOR" content="Microsoft FrontPage 5.0">
<meta name="ProgId" content="FrontPage.Editor.Document">
<meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
<title>DeepSkyStacker FAQ</title>
<style>
<!--
 div.MsoNormal
	{mso-style-parent:"";
	margin-bottom:.0001pt;
	font-size:12.0pt;
	font-family:"Times New Roman";
	margin-left:0cm; margin-right:0cm; margin-top:0cm}
.Stil1 {font-size: 12px}
.Stil2 {
	font-family: Arial, Helvetica, sans-serif;
	font-size: 13px;
}
.Stil3 {
	font-family: Arial;
	font-size: 10.0pt;
}
-->
</style>
</head>

<body>

<p><b><span lang="EN-GB" style="font-size: 18.0pt; font-family: Arial">
H&auml;ufig gestellte Fragen (FAQ) <span class="Stil1">Frequently Asked Questions</span></span></b></p>
<blockquote>

<p><span lang="en-gb"><b><span style="font-family: Arial"><a href="#Install">
Installation</a><br>
<a href="#lightdarkflatoffset">Light, Dark, Flat, Bias... Was ist das und wie erstelle ich sie?</a><br>
<a href="#FileAndList">Dateien und Dateilisten</a><br>
<a href="#Registering">Registrierung</a><br>
<a href="#Stacking">Stacking</a><br>
<a href="#Processing">Bearbeitung</a><br>
<a href="#Performances">PC-Leistung</a><br>
<a href="#saveresult">Laden/Speichern</a><br>
</span></b></span><b>
<span lang="EN-GB" style="font-family: Arial; ">
<a href="#Misc">Verschiedenes</a></span></b></p>
</blockquote>
<hr color="#0000FF">
<p align="justify"><font face="Arial"><b><font size="4" color="#FF0000">
<a name="Install"></a>Installation</font><br>
<font size="2">Die heruntergeladene Zip-Datei ist besch&auml;digt.<br>
</font></b><font size="2">Ich kann Ihnen versichern, dass die Zip-Datei auf der Webseite absolut OK ist. Oft wird zum Download ein Downloadbeschleuniger verwendet.<br>
Deaktivieren Sie ihn, laden Sie die Datei erneut und Sie werden sehen, dass alles in Ordnung ist.<br>
</font><b>
<font size="2"><br>
Ich kann DeepSkyStacker nicht installieren (Fehlermeldung: missing DLL message).<br>
</font></b><font size="2">Wenn Sie w&auml;hrend der Installation eine Fehlermeldung erhalten, in der eine fehlende DLL angezeigt wird, arbeiten Sie wahrscheinlich nicht mit Windows XP SP2.<br>
In diesem Fall m&uuml;ssen Sie zuerst den <a target="_blank" href="http://www.microsoft.com/downloads/details.aspx?FamilyID=889482FC-5F56-4A38-B838-DE776FD4138C&displaylang=en">
Windows Installer 3.1</a> <font face="Arial">herunterladen und installieren.</font></font></font></p>
<div class="MsoNormal" align="center" style="text-align:center">
  <span lang="EN-GB">
  <hr size="2" width="100%" noshade color="blue" align="center"></span>
</div>
<p align="justify"><span lang="en-gb"><font size="4" color="#FF0000"><b>
<span style="font-family: Arial"><a name="lightdarkflatoffset"></a>Light, Dark, 
Flat, Bias... Was ist das und wie erstelle ich sie?</span></b></font></span><span lang="EN-GB" style="font-family: Arial"><b><br>
<br>
Lightframes<br>
</b><font size="2">Die Lightframes sind die eigentlichen Bilder, die die echte Information enthalten. z.B. Bilder von Galaxien, Nebeln ...<br>
Dies ist die Grundlage zum Stacken.<br>
<br>
</font><b>Darkframes und Dark-Flatframes<br>
</b><font size="2">Die Darkframes werden erstellt, um das Dunkelrauschen, Verst&auml;rkergl&uuml;hen sowie Hot- und Dark-Pixel aus dem Lightframe zu entfernen (oder vom Flatframe mit den Dark-Flatframes).<br>
Alle DSLRs und CCD Kameras, die einen CMOS oder CCD Sensor verwenden, erzeugen ein sogenanntes elektronisches Dunkelrauschen, welches von der Belichtungszeit, der Temperatur und  den verwendeten ISO Einstellungen (nur DSLR) abh&auml;ngt. <br>
Zum Entfernen dieser St&ouml;rungen aus dem Lightframe wird ein Darkframe in Abzug gebracht. Das Darkframe enth&auml;lt ja nur diese St&ouml;rsignale und keine Bildinformation.<br>
<br>
Der beste Weg, um Darkframes zu erstellen, sind Aufnahmen im Dunkeln (daher der Name), mit geschlossenem Objektiv zu machen.<br>
Die Darkframes m&uuml;ssen unbedingt mit der gleichen Belichtungszeit, Au&szlig;entemperatur und ISO Einstellung, wie die Lightframes (bzw. Flatframes) aufgenommen werden.<br>
Bei gleichbleibender Au&szlig;entemperatur innerhalb der Aufnahmenacht, k&ouml;nnen die Darkframes auch am Ende der Aufnahmeserie erstellt werden. Ist dies nicht der Fall, m&uuml;ssen Sie nach jeder Lightframe-Aufnahme unmittelbar danach Ihre Darkframe Bilder machen. Das kostet nat&uuml;rlich wertvolle Aufnahmezeit, ist aber f&uuml;r das Endergebnis unheimlich wichtig.<br>
<br>
Man braucht nicht unbedingt f&uuml;r jede Lightframe-Aufnahme ein Darkframe, aber insgesamt sollten es schon einige sein (zwischen 10 und 20 ist meistens ausreichend). DeepSkyStacker kann diese automatisch kombinieren und daraus ein Master-Dark (oder Master Dark-Flat) erstellen.<br>
<br>
</font><b>Biasframes (auch Offsetframe genannt)<br>
</b><font size="2">Die Bias/Offsetframes sind dazu da, das Ausleserauschen des CCD oder CMOS 
Sensors von den Lightframes zu entfernen.<br>
Jeder CCD oder CMOS Sensor erzeugt beim elektronischen Auslesen des Chips ein St&ouml;rsignal.<br>
<br>
Bias/Offsetframes zu erstellen ist wirklich sehr einfach. Sie w&auml;hlen an Ihrer Kamera die k&uuml;rzest m&ouml;gliche Belichtungszeit (ob z.B. 1/4000s oder 1/8000s h&auml;ngt nat&uuml;rlich von Ihrer Kamera ab) und nehmen eine Reihe Aufnahmen mit verschlossenem Objektiv (wie bei den Darkframes) in der Dunkelheit auf.<br>
Wichtig bei den Bias/Offsetframes ist, dass Sie bei gleicher ISO Einstellung wie die Lightframes aufgenommen werden. Die Aussentemperatur ist dabei nicht wichtig.<br>
<br>
Auch hier ben&ouml;tigen Sie einige davon (<span lang="EN-GB" style="font-family: Arial"><font size="2">zwischen 10 und 20 ist meistens genug</font></span>). DeepSkyStacker kombiniert daraus automatisch ein Master-Bias/Offsetframe.<br>
<br>
</font><b>Flatframes<br>
</b><font size="2">Flatframes werden erstellt, um Vignetierung und ungleichm&auml;&szlig;ige Bildausleuchtung durch Staub oder Schmutz in Ihrem optischen System zu korrigieren.<br>
<br>
Um brauchbare Flatframes zu erstellen, ist es sehr wichtig, dass die Aufnahmekamera in der <strong>gleichen</strong> Stellung sitzt, wie bei der Lightframe Aufnahme. Das bedeutet, dass Sie entweder vor oder nach den Lightframes Ihre Flats aufnehmen m&uuml;ssen, bevor Sie die Lage der Kamera (z.B. f&uuml;r ein anderes Objekt) am Teleskop ver&auml;ndern. Ebenso wichtig ist, dass Sie auch an den Fokus-Einstellungen nichts gegen&uuml;ber den Lightframes ver&auml;ndern. <br>
Zum Aufnehmen von Flatframes gibt es verschiedene M&ouml;glichkeiten (inclusive der Verwendung einer Flatfield-Box), aber ich finde, dass die einfachste Methode immer noch die T-Shirt Methode ist. Dabei verdecken Sie Ihre Teleskop&ouml;ffnung mit einem wei&szlig;en T-Shirt oder Tuch (m&ouml;glichst ohne Falten). Dann richten Sie das Teleskop auf eine helle Fl&auml;che (z.B. ein gro&szlig;es helles Licht, den D&auml;mmerungshimmel oder eine helle Hauswand ...) und nehmen eine Serie von Bildern auf. Dabei stellen Sie die Kamera auf den AV-Modus, um sicherzustellen, dass die Aufnahmen weder unter- noch &uuml;berbelichtet sind.<br>
<br>
Die Flatframes sollten mit gleicher ISO-Einstellung wie die Lightframes gemacht werden. Die Au&szlig;entemperatur ist bei den Flatframes nicht wichtig.<br>
<br>
<span lang="EN-GB" style="font-family: Arial"><font size="2">Auch hier ben&ouml;tigen Sie einige davon (<span lang="EN-GB" style="font-family: Arial"><font size="2">zwischen 10 und 20 ist meistens genug</font></span>). DeepSkyStacker kombiniert daraus automatisch ein Master-Flatframe.</font></span></font></span></p>
<p align="justify"><span lang="en-gb"><font size="2">
<span style="font-family: Arial; "><b>Ist es m&ouml;glich, farbige Flatframes zu verwenden?</b><br>
Die einfache Antwort lautet zuallererst - ja.<br>
Der allgemeine Farbton Ihrer Flatframes ist nicht wirklich wichtig, da DeepSkyStacker jeden Kanal separat bearbeitet und die Flatframes dementsprechend auf jeden Kanal anwendet.<br>
Nat&uuml;rlich, wenn Ihr Flatframe vollkommen rot ist, wird es nur f&uuml;r den Rotkanal passend kalibriert sein, aber solange der H&ouml;chstwert (Peak) in jedem Kanal zwischen 1/3 und 2/3&nbsp; des Maximalwertes liegt, sollten Sie keine Probleme bei der Verwendung von leicht farbigen Flatframes haben.</span></font></span></p>
<div class="MsoNormal" align="center" style="text-align:center">
  <span lang="EN-GB">
  <hr size="2" width="100%" noshade color="blue" align="center"></span>
</div>
<p align="justify"><span lang="en-gb"><font size="4" color="#FF0000"><b>
<span style="font-family: Arial"><a name="FileAndList"></a>Dateien und Dateilisten</span></b></font></span><br>
<b><span lang="EN-GB" style="font-family: Arial">
<font size="2"><a name="TIFFIssue"></a>DSS kann meine  TIFF-Dateien nicht lesen und/oder das Programm st&uuml;rzt ab, wenn ich versuche TIFF-Dateien zu &ouml;ffnen.</font></span><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial"><br>
</span></b><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">
DeepSkyStacker unterst&uuml;tzt nur unkomprimierte TIFFDateien oder  LZW und ZIP 
(Deflate) komprimierte Dateien.<br>
Leider gibt es unterschiedliche TIFF-Dateien, von denen manche beim Dekodieren Fehler verursachen. Haupts&auml;chlich, w&auml;hrend des Auslesens der EXIF-Informationen.<br>
Es ist m&ouml;glich, mit einer &Auml;nderung des Registrierungsschl&uuml;ssels, das Dekodieren beim Lesen von TIFF-Dateien abzustellen. Dazu &auml;ndern Sie in der Registry  den Eintrag <b>HKEY_CURRENT_USER\Software\DeepSkyStacker</b>: 
SkipTIFFExifInfo (DWORD) auf einen  Wert von 1 setzen.<br>
<br>
Wenn Sie nicht wissen, wie man einen Registrierungs-Schl&uuml;ssel &auml;ndert, k&ouml;nnen Sie hier eine <a href="../download/DSS_SkipTIFFExifInfo.reg">kleine Datei</a> downloaden und mit einem Doppelklick &ouml;ffnen. Damit k&ouml;nnen Sie den Eintrag ganz einfach &auml;ndern lassen.</span></p>
<hr color="#0000FF" size="1">
<p align="justify">
<font size="2" face="Arial"><b>Meine FITS-Dateien werden nicht richtig dekodiert.<br>
</b>Es sind leider auch eine Menge FITS-Formate im Umlauf.<br>
Wenn Ihre FITS-Datei nicht richtig dekodiert wird, senden Sie mir einfach eine e-Mail mit der Datei - ich werde versuchen, die Datei korrekt zu dekodieren.</font></p>
<hr color="#0000FF" size="1">
<p align="justify"><font face="Arial" size="2"><b>Meine FITS-Dateien wurden mit einer DSLR erstellt und sind sehr dunkel und ohne irgendeinen Kontrast.<br>
</b>Die Bilderfassungs-Software von einigen DSLR speichert das 12 Bit Ausgabebild (das ist die Original-Tiefe der meisten DSLR RAW-Dateien) als 16 Bit FITS-Datei.<br>
In diesem Falle liegen die gespeicherten Werte zwischen 0 und 4095, anstatt zwischen 0 und 65535. Dies erkl&auml;rt, warum die Aufnahmen so dunkel sind.<br>
Sie k&ouml;nnen diese Parameter im <a href="userguide.htm#rawddp">FITS-Dateien Register</a> in den RAW/FITS DDP Einstellungen anpassen, um diese Dateien korrekt darzustellen.<br>
Einfach ausgedr&uuml;ckt, kann man die Helligkeit  insgesamt bis zu 16-fach erh&ouml;hen ohne den Maximalwert zu &uuml;berschreiten. Wenn Sie den Wei&szlig;abgleich &auml;ndern, indem Sie die Rot und/oder Blau-Skala ver&auml;ndern, achten Sie darauf , dass Sie jeden Wert maximal um das 16 fache erh&ouml;hen (Helligkeit * Kanal-Skala).</font></p>
<hr color="#0000FF" size="1">
<p align="justify"><font face="Arial" size="2"><b>Meine FITS-Dateien, die ich mit einer  DSLR erstellt habe scheinen falsch zu sein, obwohl ich in der FITS-Dateien Registerkarte die richtige DSLR ausgew&auml;hlt hatte.<br>
</b>Sie sollten in diesem Fall unbedingt &uuml;berpr&uuml;fen, ob im Aufnahmeprogramm kein Binnig eingestellt war. In diesem Fall kann  DSS nicht die Standard Bayer Matrix f&uuml;r Ihre  
DSLR verwenden. Dies ist wahrscheinlich der Grund, warum Ihre Bilder alle falsch erscheinen.<br>
Der einzige Weg dies zu vermeiden ist, das Deaktivieren eines Binning-Modus.</font></p>
<hr color="#0000FF" size="1">
<p align="justify"><font face="Arial" size="2"><b>Obwohl meine FITS-Dateien mit einer Farb-CCD Kamera erstellt wurden, habe ich nur S/W Bilder.<br>
</b>Ihre  FITS-Dateien ben&ouml;tigen zum Dekodieren eine  Bayer-Matrix (wie eine DSLR). Damit die Farben richtig dekodiert werden, m&uuml;ssen Sie wissen, welche Art Bayer-Matrix Ihre Kamera ben&ouml;tigt.<br>
Dazu k&ouml;nnen Sie im  FITS Reiter bei den <a href="userguide.htm#rawddp">RAW/FITS DDP 
Einstellungen</a>  DeepSkyStacker mitteilen, welche Bayer-Matrix verwendet werden soll. In den meisten F&auml;llen k&ouml;nnen Sie hierzu im Auswahlfenster einfach Ihren Kameratyp aus einer Liste ausw&auml;hlen.</font></p>
<hr color="#0000FF" size="1">
<p align="justify"><font face="Arial"><font size="2"><b>Was ist eine Dateiliste?<br>
</b></font><font size="2">Eine Dateiliste ist einfach nur eine Text-Datei, die den Dateinamen f&uuml;r jede Datei, deren Dateityp (Light, Dark, Flat, Offset) und deren Status 



(aktiviert oder deaktiviert) enth&auml;lt. <br>
Sie sollten beachten, dass eine Dateiliste, wenn sie geladen wird, alle Dateien enth&auml;lt die nicht gel&ouml;scht wurden.<br>
So ist es m&ouml;glich eine Dateiliste mit allen Darkframes, eine andere mit den Flatframes und eine dritte mit dem Master-Offset in einem Arbeitsgang zu laden.<br>
Eine vollst&auml;ndige Erl&auml;uterung des Dateilisten-Formats finden Sie <a href="commandline.htm#filelistformat">
hier</a>.</font></font></p>
<hr color="#0000FF" size="1">
<p align="justify"><b><font face="Arial" size="2">Ich habe in mehreren N&auml;chten Aufnahmen des gleichen Objekts angefertigt. Wie kann ich nun DSS mitteilen, welche Dark- und Lightframes von jeder Nacht zusammengeh&ouml;ren?</font></b><font size="2" face="Arial"><b><br>
</b> Die Antwort auf diese Frage ist die Verwendung von <a href="technical.htm#filegroup">Datei-Gruppen</a>.</font></p>
<div class="MsoNormal" align="center" style="text-align:center">
  <span lang="EN-GB">
  <hr size="2" width="100%" noshade color="blue" align="center"></span>
</div>
<p align="justify"><b>
<span lang="EN-GB" style="font-size: 13.5pt; font-family: Arial; color: red">
<a name="Registering"></a>Registrierung</span><span lang="EN-GB" style="font-family: Arial"><br>
</span><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">Warum wird f&uuml;r jedes Bild eine Registrierungs-Datei erstellt?<br>
</span></b><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">
Weil es einfacher ist. Au&szlig;erdem vermeidet man eine erneute Registrierung von bereits registrierten Aufnahmen.<br>
Auf diesem Weg vermeidet man au&szlig;erdem, dass w&auml;hrend des  Registrierungs- und Stacking-Prozesses immer alle Bilder geladen werden m&uuml;ssen.</span></p>
<hr color="#0000FF" size="1">
<p align="justify"><b><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">Kann ich die Registrierungsdatei l&ouml;schen?<br>
</span></b><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">Ja. Sie wird bei Bedarf einfach wieder erstellt.</span></p>
<hr color="#0000FF" size="1">
<p align="justify"><b><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">Kann ich den Inhalt der Registrierungsdatei ver&auml;ndern?<br>
</span></b><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">Ja, auch wenn es daf&uuml;r weder einen Grund noch eine Notwendigkeit gibt.<br>
Ich kann nicht daf&uuml;r garantieren, dass der ver&auml;nderte Inhalt korrekt entwickelt wird, sondern nur, dass der aktuelle Inhalt immer zu dekodieren ist.</span></p>
<hr color="#0000FF" size="1">
<p align="justify"><b><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">
<a name="score"></a>Was ist der Score-Wert und was bedeutet er?<br>
</span></b> <span class="Stil2">Das Ergebnis ist ein Ma&szlig; f&uuml;r die Bildqualit&auml;t. <br>
Um es ganz einfach auszudr&uuml;cken: Je h&ouml;her die Punktzahl, desto mehr runde und nicht zu gro&szlig;e Sterne wurden bei der Analyse gefunden. </span></p>
<hr color="#0000FF" size="1">
<p align="justify"><b><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">Ist der Score-Wert ein absolutes Ma&szlig; f&uuml;r die Bildqualit&auml;t?<br>
</span></b><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">Nein. Der Score-Wert ist nur ein relativer Wert, der zur Sortierung der Aufnahmen dient. So l&auml;&szlig;t sich vor dem Stacking Prozess eine Auswahl der Bilder treffen, die sich ungef&auml;hr alle in einer Qualit&auml;tsregion befinden.<br>
Bei &Auml;nderungen in den <a style="color: blue; text-decoration: underline; text-underline: single" href="technical.htm#rawdecod">RAW Entwicklungsprozess-Einstellungen</a> m&uuml;ssen Sie die Aufnahmen erneut registrieren und erhalten somit nat&uuml;rlich f&uuml;r jede Aufnahme neuberechnete Score-Werte.</span></p>
<div class="MsoNormal" align="center" style="text-align:center">
  <span lang="EN-GB">
  <hr size="2" width="100%" noshade color="blue" align="center"></span>
</div>
<p align="justify" style="margin-bottom: 0;"><b>
<span lang="EN-GB" style="font-size: 13.5pt; font-family: Arial; color: red">
<a name="Stacking"></a>Stacking</span><span lang="EN-GB" style="font-family: Arial"><br>
</span><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">
<a name="autosave"></a>Was ist die AutoSave.DSImage Datei, die nach jedem Stacking Prozess erstellt wird?<br>
</span></b><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">Die  
AutoSave.DSImage-Datei ist eine gesch&uuml;tzte Datei, die automatisch am Ende eines jeden Stacking Prozesses erstellt wird und das End-Bild enth&auml;lt. Es handelt sich um ein Bildformat mit 32 Bit (echte)/Kanal.</span></p>
<p align="justify" style="margin-top: 0;"><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial"> Da die einzige M&ouml;glichkeit, diese Datei zu erstellen, ein erneutes Stacken bedeutet, kann sie auch nicht irrt&uuml;mlicherweise &uuml;berschrieben werden.<br>
  Sie kann &uuml;ber den Reiter &quot;Entwicklung&quot; wieder ge&ouml;ffnet werden.<br>
  Ab der Version 2.5.3 wurde dieses eigene AutoSave.DSImage Dateiformat durch ein AutoSave.tif. Dateiformat ersetzt. Es handelt sich bei dieser Datei um eine echte 32 Bit TIFF-Datei.<br>
Alte .DSImage-Dateien k&ouml;nnen nat&uuml;rlich immer noch mit DeepSkyStacker ge&ouml;ffnet werden..</span></p>
<hr color="#0000FF" size="1">
<p align="justify"><b>
<span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">Das fertige Bild zeigt mehrere Sterngruppen im ganzen Bild<br>
</span></b><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">
Mehrere Sterngruppen ist ein sicheres Zeichen daf&uuml;r, dass der Ausrichtungs-Prozess sich auf &quot;falsche&quot; Sterne verlie&szlig;.<br>
Einer der Hauptgr&uuml;nde f&uuml;r diese falsche Ausrichtung ist, dass Hot-Pixel als Sterne erkannt werden und somit eine korrekte Ausrichtung nat&uuml;rlich nicht m&ouml;glich ist.<br>
Sie k&ouml;nnen versuchen mit einer automatischen Erkennung von Hot-Pixel (siehe Registrierungs-Optionen) dieses Verhalten zu verhindern. Besser ist nat&uuml;rlich, die Verwendung von Darkframes im Registrierungs-Prozess.<br>
Alle ausgew&auml;hlten Dark-, Flat- und Offsetframes werden bei jedem Lightframe vor der Registrierung angewendet und verhindern so garantiert die St&ouml;rung durch Hot-, Cold-Pixel und sonstige Artefakte. Die Sterne werden dann auch viel besser und exakter erkannt.</span></p>
<hr color="#0000FF" size="1">
<p align="justify"><b>
<span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">Das fertige Bild ist an der oberen, linken Ecke stark beschnitten.<br>
</span></b><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">
Dies ist der Fall, wenn Sie das Lightframe im Super-Pixel-Modus registriert hatten und das Stacken in einem anderen Modus ausf&uuml;hren.<br>
Beim Wechsel vom oder zum Super-Pixel-Modus ist es auf jeden Fall erforderlich die Lightframes neu zu registrieren.</span></p>
<hr color="#0000FF" size="1">
<p align="justify"><font size="2"><b><span style="font-family: Arial">Meine Darkframes haben nicht alle die gleiche Belichtungszeit und DeepSkyStacker will sie deshalb nicht zusammen gruppieren.</span></b></font><b><span style="font-size: 10.0pt; font-family: Arial"><br>
</span></b><span style="font-size: 10.0pt; font-family: Arial">Wenn Sie bei den Aufnahmen kein automatisches Programm verwenden, welches die Belichtungszeit genau steuert, kann es passieren, dass Ihre Aufnahmen nur um ein paar Sekunden differieren. In diesem Fall ist es DeepSkyStacker nicht m&ouml;glich, die Darks zu gruppieren und ein Masterdark zu erstellen.<br>
In diesem Falle k&ouml;nnen Sie die Belichtungszeitwerte jedes Frames erzwingen, indem Sie die Bilder einzeln in der Liste ausw&auml;hlen und mit dem Kontext-Men&uuml; die <a href="userguide.htm#contextmenu">Bild-Eigenschaften</a> <span style="font-size: 10.0pt; font-family: Arial">&uuml;berarbeiten.</span></span></p>
<hr color="#0000FF" size="1">
<p align="justify"><font size="2"><b><span style="font-family: Arial">Mein fertiges Bild ist viel zu dunkel. Ist das normal?<br>
</span></b></font><span style="font-size: 10.0pt; font-family: Arial">Sehr dunkle RAW Bilder ergeben beim Stacken auch ein sehr dunkles fertiges Bild.<br>
Um Details besser sichtbar zu machen, muss das Bild eventuell vorher mit den RGB Reglern und der Luminanz-Einstellung einem sogenannten &quot;Stretching&quot; unterzogen werden. Dies kann man in dem <span style="font-size: 10.0pt; font-family: Arial"><a href="userguide.htm#processingtab">Register Entwicklung</a></span>  einstellen.</span></p>
<hr color="#0000FF" size="1">
<p align="justify"><font size="2"><span style="font-family: Arial"><b>Wie richte ich das fertige Bild, bestehend aus 4 Stacks aus (Rot, Gr&uuml;n, Blau und Luminanz)?<br>
</b>Zum Ausrichten des fertigen Bildes an dem selben Refferenz-Frame, m&uuml;ssen Sie das Refferenz-Frame zur Liste hinzuf&uuml;gen, sogar wenn es nicht vom gleichen Stack ist. Sagen Sie 
DeepSkyStacker, dass er dieses Bild als Refferenz-Frame verwenden soll (benutzen Sie dazu das <a href="userguide.htm#contextmenu">Kontext-Men&uuml;</a>) aber haken Sie es nicht an.<br>
Das sagt DeepSkyStacker, dass er es nur als Refferenz-Frame verwenden soll, <strong>ohne</strong> es im Stacking-Prozess mit einzubinden.</span></font></p>
<div class="MsoNormal" align="center" style="text-align:center">
  <span lang="EN-GB">
  <hr size="2" width="100%" noshade color="blue" align="center"></span>
</div>
<p align="justify"><b>
<span lang="EN-GB" style="font-size: 13.5pt; font-family: Arial; color: red">
<a name="Processing"></a>Bearbeitung<br>
</span><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">Was ist die DSSSettings.DSSSettings-Datei die im  DeepSkyStacker.exe Ordner erstellt wird?<br>
</span></b><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">Die 
DSSSettings.DSSSettings-Datei enth&auml;lt alle &Auml;nderungseinstellungen, die im Bearbeitungs-Register gespeichert und geladen werden k&ouml;nnen.</span></p>
<hr color="#0000FF">
<p align="justify"><b><font face="Arial" size="4" color="#FF0000">
<a name="Performances"></a>PC-Leistung<br>
</font><font face="Arial" size="2">Wie l&auml;&szlig;t sich der Stacking-Prozess beschleunigen</font></b><font size="2" face="Arial"><b>?<br>
</b>Neben den offensichtlichen Antworten (schnellerer Prozessor und mehr RAM Speicher) ist der beste Weg den Prozess zu beschleunigen, indem man auf eine Interpolationsmethode (<a href="technical.htm#bayerdrizzle">Bayer-Drizzle und Super-Pixel</a>) verzichtet. oder indem man die Bilineare Interpolation oder AHD Interpolation verwendet, die beide nur mit RAW Bilder arbeiten und einem monochromen 16 Bit/Kanal anstatt 3 RGB Kan&auml;len.<br>
Die Bild-Dekodierung geht damit schneller (schnelle oder keine Interpolation), der erforderliche Speicher ist lediglich 1/3 so gro&szlig; und Flat-, Dark- und Offset-Frames werden berechnet und intern in einer Ebene gespeichert anstatt in 3.<br>
<br>
Ein anderer Weg schneller an das fertige Bild zu kommen, ist die Verwendung eines <a href="technical.htm#customrect">Auswahl-Rechtecks</a>, welches nur den interessanten Teil des Bildes enth&auml;lt.</font></p>
<div class="MsoNormal" align="center" style="text-align:center">
  <span lang="EN-GB">
  <hr size="2" width="100%" noshade color="blue" align="center"></span>
</div>
<p align="justify"><b>
<span lang="EN-GB" style="font-size: 13.5pt; font-family: Arial; color: red">
<a name="saveresult"></a>Laden/Speichern</span><span lang="EN-GB" style="font-family: Arial"><br>
</span><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">Wo sind die Nachbearbeitungs Anpassungs-Einstellungen der TIFF-Dateien gespeichert?<br>
</span></b><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">Die Einstellungen sind als privater TIFF Anhang (private tags) gespeichert. Sie bilden einen Dokumentenanhang innerhalb des TIFF Formats. <br>
Auf der anderen Seite, wenn Sie die TIFF-Datei mit einem anderen Programm als DeepSkyStacker &uuml;berarbeiten, geht Ihnen dieser TIFF Anhang mit den Einstellungen verloren.</span></p>
<hr color="#0000FF" size="1">
<p align="justify"><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">
<b>Was ist eigentlich der Unterschied zwischen den &quot;angewandten Anpassungs-Einstellungen&quot; und den &quot;eingebetteten Anpassungs-Einstellungen&quot; in den TIFF-Dateien?<br>
</b>Bei den &quot;eingebetteten Anpassungs-Einstellungen&quot; in der gespeicherten TIFF-Datei verbleibt das Bild ohne &Auml;nderungen, also so, wie es aus dem Stacking-Prozess hervorgeht.  Die Einstellungen sind aber noch vorhanden, aber nur in der Datei als <strong>tag</strong> &quot;eingebettet&quot;, sodass Sie Ihre Arbeit an dem Punkt fortsetzen k&ouml;nnen, an dem Sie aufgeh&ouml;rt haben. Sie haben damit die M&ouml;glichkeit, Ihre Arbeit jederzeit zu stoppen und sp&auml;ter an gleicher Stelle weiterzuarbeiten.<br>
Diese Option ist sehr n&uuml;tzlich, wenn Sie sp&auml;ter mit DeepSkyStacker oder einer anderen Software weiterarbeiten m&ouml;chten.<br>
<br>
Bei den &quot;angewandten Anpassungs-Einstellungen&quot; wird das Bild als TIFF-Datei mit den bereits angewendeten Einstellungen nach dem Stacking gespeichert. Es ist  genau das Bild, das Sie im Prozess Register sehen, mit allen bereits ausgef&uuml;hrten Anpassungen.</span></p>
<hr color="#0000FF" size="1">
<p align="justify"><b><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">Photoshop 
kann die von DeepSkyStacker erstellten 32 Bit (Ganzzahl-Typ) TIFF-Dateien nicht &ouml;ffnen. Warum?<br>
</span></b><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">
Richtig. Sie m&uuml;ssen die TIFF-Datei im 32 Bit (Gleitkommazahlen-Typ) Format speichern, um sie sp&auml;ter in Photoshop &ouml;ffnen zu k&ouml;nnen.<br>
Nur Software wie 
Pleiades’ PixInsight kann 32 Bit (Ganzzahlen-Typ) TIFF-Dateien &ouml;ffnen, die von  
DeepSkyStacker erstellt wurden.</span></p>
<hr color="#0000FF" size="1">
<p align="justify"><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">
<b>Ist DeepSkyStacker in der Lage Einstellungen in der Registry zu speichern?<br>
</b>Ja. DeepSkyStacker speichert alle Einstellungen, wie z.B. die zuletzt verwendeten Ordner f&uuml;r jede Dateiart, zuletzt eingestellte Einstellungen in den Dialog-Feldern u.s.w...<br>
All diese Einstellungen werden in der Registry-Datei &quot;HKEY_CURRENT_USER\Software\DeepSkyStacker key&quot; gespeichert.</span></p>
<div class="MsoNormal" align="center" style="text-align:center">
  <span lang="EN-GB">
  <hr size="2" width="100%" noshade color="blue" align="center"></span>
</div>
<p align="justify" style="margin-bottom: 0;"><b>
<span lang="EN-GB" style="font-size: 13.5pt; font-family: Arial; color: red">
<a name="Misc"></a>Verschiedenes</span></b><span lang="EN-GB"><br>
</span><b><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">Warum 
DeepSkyStacker?<br>
</span></b><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">
Ganz einfach, weil ich eine Menge Zeit damit verbracht habe immer und immer wieder, die gleichen Bearbeitungsschritte f&uuml;r jede neue Bilderreihe an jedem neuen Bild auszuf&uuml;hren und mir dies einfach keinen Spa&szlig; mehr machte.</span></p>
<p align="justify" style="margin-top: 0;"><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial"> Jeder Besitzer einer DSLR wird sicherlich verstehen was ich meine: TIFF-Umwandlung 
  (oder CFA f&uuml;r die Mutigen), registrieren, stacken...<br>
  <br>
  Nach dem Test einiger &quot;speicherfressender&quot; Programme, kam ich zu dem Entschluss, mir selbst ein Programm zu schreiben. Es sollte genau auf meinen Bedarf zugeschnitten sein. Ich wollte die gro&szlig;e Menge an anfallenden Bildern (manchmal einige Hundert) in einen automatischen Prozess stecken, mich beruhigt schlafen legen, um mich am n&auml;chsten Morgen der Nachbearbeitung zu widmen - die auch wesentlich mehr Spass macht.</span></p>
<hr color="#0000FF" size="1">
<p align="justify" style="margin-bottom: 0;"><b><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">Warum kann man keine Planetenbilder stacken?<br>
</span></b><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">Warum? 
Weil ich von Planetenaufnahmen eigentlich wenig Ahnung habe, w&uuml;sste ich auch nicht, wo ich da anfangen sollte.<br>
Vielleicht schreibe ich irgendwann auch mal ein Programm &quot;PlanetaryStacker&quot; ... aber ich w&uuml;rde an Ihrer Stelle nicht darauf warten :-)</span></p>
<p align="justify" style="margin-top: 0;"><span class="Stil3">Au&szlig;erdem gibt es in diesem Bereich wirklich gute Freeware, wie Giotto oder Registax. </span></p>
<hr color="#0000FF" size="1">
<p align="justify"><b><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">Was war eigentlich 
DeepSkyStacker 1.0?<br>
</span></b><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">
DeepSkyStacker 1.0 lief nur auf meinem Rechner und den von einigen guten Freunden.. Es war f&uuml;r eine &ouml;ffentliche Verwendung einfach noch nicht ausgereift genug. Es fehlten zu viele Funktionen und alles lief noch nicht sehr rund.<br>
DeepSkyStacker 2.0 war die erste ver&ouml;ffentlichte Version.</span></p>
<hr color="#0000FF" size="1">
<p align="justify"><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">
<b>In welcher Programmiersprache ist  DeepSkyStacker erstellt worden?<br>
</b>DeepSkyStacker ist in <strong>C++</strong> programmiert.</span></p>
<hr color="#0000FF" size="1">
<p align="justify"><b><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">Wie werden die RAW-Dateien dekodiert?<br>
</span></b><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">Die 
RAW-Dateien werde mit dem gro&szlig;artigen <a href="http://www.cybercom.net/~dcoffin/dcraw/" target="_blank" style="color: blue; text-decoration: underline; text-underline: single">
DCRAW</a> von Dave Coffin dekodiert.<br>
Au&szlig;erdem m&ouml;chte ich ihm f&uuml;r die Empfehlung, den <a style="color: blue; text-decoration: underline; text-underline: single" href="technical.htm#bayerdrizzle">Bayer Drizzle</a> Algorithmus einzubinden, recht herzlich danken.</span></p>
<hr color="#0000FF" size="1">
<p align="justify"><b><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">Wird mein DSLR-Format unterst&uuml;tzt?<br>
</span></b><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">Die Liste aller unterst&uuml;tzten DSLR's (z.Zt. mehr als 
300 Stck.) wird st&auml;ndig erg&auml;nzt. Da ich in jeder Programmversion die neuste Version von <a href="http://www.cybercom.net/~dcoffin/dcraw/" target="_blank" style="color: blue; text-decoration: underline; text-underline: single">
DCRAW</a> verwende, k&ouml;nnen Sie auf deren Webseite erfahren, ob auch Ihre DSLR schon unterst&uuml;tzt wird.<br>
Wenn dies so ist, k&ouml;nnen Sie davon ausgehen, dass  DeepSkyStacker Ihre Kamera auch unterst&uuml;tzt.</span></p>
<hr color="#0000FF" size="1">
<p align="justify"><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">
<b>Wie werden TIFF Bilder in DeepSkyStacker gelesen und geschrieben?<br>
</b>Die TIFF-Dateien werden gelesen und geschrieben mit dem excellenten <strong>libtiff library.</strong></span></p>
<hr color="#0000FF" size="1">
<p align="justify"><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">
<b><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial"><b>Wie werden FITS-Dateien in DeepSkyStacker gelesen und geschrieben?</b></span><br>
</b><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">Die FITS-Dateien werden gelesen und geschrieben mit dem excellenten</span> <strong>CFitsIO library.</strong></span></p>
<hr color="#0000FF" size="1">
<p align="justify"><b><font face="Arial" size="2">Ist es m&ouml;glich die Sprache von DeepSkyStacker zu &auml;ndern?</font></b><font size="2" face="Arial"><b><br>
</b>Die Sprache von DeepSkyStacker (Franz&ouml;sisch, Englisch, Spanisch, Tchechisch, Italienisch, Catalanisch, Holl&auml;ndisch oder Deutsch) richtet sich nach der im System eingestellten Sprache.<br>
Wenn Sie allerdings eine andere Sprache w&auml;hlen wollen, k&ouml;nnen Sie diese in der Dialogbox &quot;&Uuml;ber DeepSkyStacker&quot; ausw&auml;hlen.<br>
Nach einem Neustart von DeepSkyStacker ist die gew&auml;hlte Sprache aktiviert.</font></p>
<hr color="#0000FF" size="1">
<p align="justify" style="margin-bottom: 0;"><font size="2" face="Arial"><b>Wie weis ich, dass es eine neue Version von DeepSkyStacker gibt?<br>
</b>Um zu pr&uuml;fen, ob eine neue Version vorliegt, kann man in der Dialogbox &quot;&Uuml;ber DeepSkyStacker&quot; ein H&auml;kchen setzen. DeepSkyStacker verbindet sich dann beim Start mit der Webseite und&nbsp; &uuml;berpr&uuml;ft, ob die verwendete Version die neuste ist oder ob ein neuerer Download bereitsteht.</font></p>
<p align="justify" style="margin-top: 0;"><font size="2" face="Arial">DeepSkyStacker sendet Ihnen keine pers&ouml;nliche Info (Newsfunktion) zu, um Sie &uuml;ber Updates zu informieren, sondern zeigt Ihnen mit einer kleinen Meldung die Updatem&ouml;glichkeit an.</font></p>
<hr color="#0000FF" size="1">
<p align="justify"><b><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">Ist 
DeepSkyStacker ein Open Source-Programm? Ist der Quellcode verf&uuml;gbar?<br>
</span></b><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">Weder das eine noch das andere ...sorry</span></p>

<hr color="#0000FF" size="1">
<p align="justify"><span lang="EN-GB" style="font-size: 10.0pt; font-family: Arial">
<b>Wie kann ich  DeepSkyStacker deinstallieren?<br>
</b>Das ist ganz einfach. Verwenden Sie dazu die &quot;Entfernen&quot;-Funktion im Software-Ordner der Systemsteuerung.</span></p>

<script type="text/javascript">
var gaJsHost = (("https:" == document.location.protocol) ? "https://ssl." : "http://www.");
document.write(unescape("%3Cscript src='" + gaJsHost + "google-analytics.com/ga.js' type='text/javascript'%3E%3C/script%3E"));
</script>
<script type="text/javascript">
try {
var pageTracker = _gat._getTracker("UA-7477345-1");
pageTracker._trackPageview();
} catch(err) {}</script>

</body>

</html>